[{"title": "Black Excellence in Tech: Panelist Spotlight – Wilmarie De La Cruz Mejia", "link": "https://codeup.com/codeup-news/panelist-spotlight-4/", "date_published": "Feb 16, 2023", "content": "\nBlack excellence in tech: Panelist Spotlight – Wilmarie De La Cruz Mejia\n\nCodeup is hosting a Black Excellence in Tech Panel in honor of Black History Month on February 22, 2023! To further celebrate, we’d like to spotlight each of our panelists leading up to the discussion to learn a bit about their respective experiences as black leaders in the tech industry!  \nMeet Wilmarie!\nWilmarie De La Cruz Mejia is a current Codeup student on the path to becoming a Full-Stack Web Developer at our Dallas, TX campus. \nWilmarie is a veteran expanding her knowledge of programming languages and technologies on her journey with Codeup. \nWe asked Wilmarie to share more about her experience at Codeup. She shares, “I was able to meet other people who were passionate about coding and be in a positive learning environment.”\nWe hope you can join us on February 22nd to sit in on an insightful conversation with Wilmarie and all of our panelists!\n"}, {"title": "Black excellence in tech: Panelist Spotlight – Stephanie Jones", "link": "https://codeup.com/events/black-excellence-in-tech-panelist-spotlight-stephanie-jones/", "date_published": "Feb 13, 2023", "content": "\nBlack excellence in tech: Panelist Spotlight – Stephanie Jones\nCodeup is hosting our second Black Excellence in Tech Panel in honor of Black History Month on February 22, 2023! To further celebrate, we’d like to spotlight each of our panelists leading up to the discussion to learn a bit about their respective experiences as black leaders in the tech industry!  \nMeet Stephanie!\n\nStephanie Jones is an Alumna of Codeup’s Data Science Program (March 2022) and currently works as a Business Intelligence Developer for Victory Capital, a global investment management firm based in San Antonio, TX. \nStephanie is passionate about visual storytelling and, as a late “tech bloomer,” is also an advocate for equitable access and educational opportunities in technology for underserved communities.\nWe asked Stephanie to share more about her experience at Codeup. She shares, “I have always been a creative and Codeup opened up a world of possibilities by exposing me to advanced technical concepts and career opportunities.” Stephanie also speaks to the community of support in the program and beyond.  “The network and support from instructors, mentors, and peers began during the application phase (which was intense), before the program even started, and has carried over even after completing the program and entering into the workforce.”\nWe hope you can join us on February 22nd to sit in on an insightful conversation with Stephanie and all of our panelists!\n"}, {"title": "Black excellence in tech: Panelist Spotlight – James Cooper", "link": "https://codeup.com/events/black-excellence-in-tech-panelist-spotlight-james-cooper/", "date_published": "Feb 10, 2023", "content": "\nBlack excellence in tech: Panelist Spotlight – James Cooper\nCodeup is hosting our second Black Excellence in Tech Panel in honor of Black History Month on February 22, 2023! To further celebrate, we’d like to spotlight each of our panelists leading up to the discussion to learn a bit about their respective experiences as black leaders in the tech industry! \nMeet James!\n\nJames Cooper is the Senior Placement Manager at Codeup, and will also be the Moderator for the Black Excellence in Tech Panel. James previously served as an Athletic Director in higher education and in that role his responsibilities included liaison for Title IX. As Title IX liaison, James oversaw complaints of discrimination and identifying and addressing any patterns or systemic problems that arose during the review of complaints. Additionally, he spent two years assisting the Department of Justice in building college campuses’ capacity to lessen violence against women, to administer justice for victims of domestic violence, dating violence, sexual assault, and stalking, and to increase services for those victims.\nAt Codeup, James helps students identify career opportunities and supply them with the necessary tools to ensure they are able to compete for those opportunities. We asked James about his experience at Codeup, he shared, “This is the first employer in my professional experiences that promotes true autonomy and community amongst its staff.”\nJames believes in his ability to overcome many obstacles and challenges and utilizes his lens and social construct towards the Human-Centered Approach to Service Delivery. He serves as an infinite example of thought provoking philosopher bridging gaps between academics, athletics and prioritizing the process of transitioning community assets and values for a sustainable legacy.\nWe hope you can join us on February 22nd to sit in on an insightful conversation with James and all of our panelists!\n"}, {"title": "Black excellence in tech: Panelist Spotlight – Jeanice Freeman", "link": "https://codeup.com/events/black-excellence-in-tech-panelist-spotlight/", "date_published": "Feb 6, 2023", "content": "\nBlack excellence in tech: Panelist Spotlight – Jeanice freeman\nCodeup is hosting our second Black Excellence in Tech Panel in honor of Black History Month on February 22, 2023! To further celebrate, we’d like to spotlight each of our panelists leading up to the discussion to learn a bit about their respective experiences as black leaders in the tech industry!\nMeet Jeanice!\nJeanice Freeman is the Student Experience Specialist at Codeup, where her role is to provide support, advocacy, inclusivity, growth, and resources for students. Prior to Codeup, she worked in higher education, k-12 education, community development, and human services providing support, resources, training, development, and growth opportunities. She holds a B.S and M.S degree and is currently working on her Ed. D in Executive Leadership. She plans to continue doing what she loves as an educator and provide space and opportunities for adult learners to continue to grow.\nWe asked Jeanice about her experience with Codeup. She shared, “Codeup has allowed me to do what I love and create spaces for others to thrive and grow. I am able to work with diverse populations and provide support and development opportunities for non-traditional students. Codeup has also provided opportunities for my own growth and with that has become a special organization to be a part of.”\nDon’t forget to tune in on February 22nd to sit in on an insightful conversation.\n"}, {"title": "Coding Bootcamp or Self-Learning? Which is Best for You?", "link": "https://codeup.com/tips-for-prospective-students/coding-bootcamp-or-self-learning/", "date_published": "Jan 20, 2023", "content": "\nIf you’re interested in embarking on a career in tech, it is likely that you have taken a look into two learning paths: self-learning vs. coding bootcamps. But what are the differences?\nSelf-Learning\nMany online institutions offer self-learning courses. This is becoming increasingly popular as students are becoming more aware of their individual learning styles, and value flexibility and self-paced programs.\nAdvantages of Self-Learning\n\nYou can form your instruction at times that best suit your needs and lifestyle\nYou can purse your new path from the comfort of your home if you choose!\nThere are many self-learning courses that offer flexible payment options\n\nDisadvantages of Self-Learning\n\nWorking alone can sometimes lead to a lack of motivation, requiring a great deal of strictness to remain on track\nThere are no peers or instructors physically present to study with or ask questions\n\nTraditional Coding Bootcamp\nCoding bootcamps have a reputation for being the accelerated path to launching a career in tech. This tends to work best for students that thrive off of structured learning, with a support team to assist throughout the process.\nAdvantages of Coding Bootcamps\n\nBootcamps are typically instructor-led meaning you have access to industry experts throughout your program to help you fully understand the material\nYou and your peers will more than likely need to complete a project together before the end of your course. This will aid in forming connections with the next group of individuals to enter the tech industry (which is great for networking!)\nTo employers, completing a program through a coding bootcamp looks phenomenal! This demonstrates your ability to commit to something complex and learn quickly.\n\nDisadvantages of Coding Bootcamps\n\nEvery piece of information covered in a coding bootcamp’s curriculum may not be imperative to your new role. A top goal of a bootcamp is to lay a good foundation for many possible careers. This means that if the curriculum covers pieces you may already know, or that do not exactly pertain to you, you will still need to be actively involved in the lessons.\nIf you are someone who prefers to spend a lot of time absorbing information, you may not be given the opportunity to do so, given that a bootcamp has a structured curriculum with time frames for each topic.\n\nBoth options have their advantages and disadvantages, but selecting which path is the correct choice for you should be based on your learning style and life circumstances.\nCodeup\nCodeup is the first, and currently the only accredited* coding bootcamp in Texas. Our program offerings range from 15 to 20 weeks and include: Full-Stack Web Development, Data Science and Cloud Administration. These programs are open to individuals of all backgrounds and experience levels.\nWhen you decide to transition careers with Codeup, our commitment to you goes beyond class-time. You will have direct access to a support system including:\n\nAdmissions and financial aid managers\nA student experience team\nInstructors who are subject matter experts\nA placement team looking to help you secure a job in-field once you graduate\n\nWe also offer a tuition refund guarantee! We will refund your paid tuition back to you if you do not find a job in-field within six months of completing a Codeup program.\nIf this sounds like a good fit for you, use any of the following options to launch your career in tech!\n\nAttend a 100% free instructor-led workshop to try your hand at coding!\nRequest more information on one or all of our programs\nGet started now by filling out a quick form\nSchedule time with an admissions manager to talk through the process\n\n*Codeup is accredited for postsecondary, non-degree granting, career and technology programs by the Middle States Commission on Secondary Schools of the Middle States Association of Colleges and Schools, 3624 Market Street, Philadelphia, PA 19104, (267) 284-5000\n"}, {"title": "Codeup Among Top 58 Best Coding Bootcamps of 2023", "link": "https://codeup.com/codeup-news/codeup-best-bootcamps/", "date_published": "Jan 12, 2023", "content": "\nCodeup is pleased to announce we have been ranked among the 58 best coding bootcamps of 2023 by Course Report!\nCourse Report is a platform that has become essential in researching coding bootcamps over the last 10 years. Every year, Course Report shares a list of coding bootcamps worldwide that meet a high standard in their educational offerings. The following were factors in the decision-making process:\n\nAlumni and Student Reviews\nTransparency Around Career Outcomes\nSalary-Based Financing Options\nSchool’s Operation Time\nNumber of Campuses\nSelectivity in the Application Process\nVetted Lending Partnerships\nThe Caliber of Career Support\nCommitment to Diversity\n\nCodeup was highlighted for being an established school with transparent outcomes.\nCourse Report is primarily utilized by previous and potential students seeking information on coding bootcamps. Our outstanding alumni have shared their genuine experiences upon completing Codeup programs; anyone seeking information on Codeup can access their reviews!\nA huge thank you goes to our alumni for sharing your journeys, the Codeup staff for continuing to deliver excellence, and Course Report for recognizing our school in this year’s rankings.\n\n"}]