[{"category": "technology", "title": "'Best wishes to my classmate,' writes Gates in book gifted to Mahindra, latter shares pic", "content": "Businessman Anand Mahindra on Tuesday met Microsoft Co-founder Bill Gates, who is currently on a visit to India. Mahindra said that Gates gifted an autographed copy of his book to him with a message saying, \"Best wishes to my classmate!\" Mahindra had earlier said that Gates started Harvard College the same year as him in 1973 but later dropped out."}, {"category": "technology", "title": "Identify 10 problems of the society that AI can solve: PM to tech stakeholders", "content": "PM Narendra Modi on Tuesday asked tech stakeholders whether they could identify 10 problems of the society that can be solved using artificial intelligence (AI). Addressing the post-budget webinar on 'Unleashing the Potential — Ease of Living using Technology', he said that India is creating a modern digital infrastructure. Technologies like 5G and AI are leading conversations now, he added."}, {"category": "technology", "title": "Fake LinkedIn profile of founder created using AI gets funding offer within 24 hrs", "content": "Walnut CEO Roshan Patel revealed that he created a fake LinkedIn profile of a founder and received an investment offer within 24 hours. Patel used an AI-generated picture of a \"white male face\" for the profile of Chad Smith, a former Stripe employee and Stanford dropout. An investor messaged Smith saying, \"I'd love to connect to...share more about our fund.\""}, {"category": "technology", "title": "Soon our farmers will produce green fuel & green hydrogen: Gadkari", "content": "Union Minister for Road Transport and Highways Nitin Gadkari said that India imports ₹16 lakh crore worth of fossil fuel every year \"but pretty soon our farmers will produce green fuel and green hydrogen\". \"Hydrogen is our future fuel and India's future vehicles will run on hydrogen and green fuels,\" Gadkari added."}, {"category": "technology", "title": "Technology will help India become developed nation by 2047: PM", "content": "Technology will help India achieve the target of becoming a developed nation by 2047, PM Narendra Modi said on Tuesday. India is creating a modern digital infrastructure and ensuring that the benefits of the digital revolution reach everyone, he added. \"We want to reduce the compliance cost of small businesses...We have finished 40,000 compliances,\" PM Modi further said.\n"}, {"category": "technology", "title": "India awarded Government Leadership Award at Mobile World Congress", "content": "India has been awarded the Government Leadership Award at the Mobile World Congress 2023 in Barcelona. India \"has a long list of achievements over the past year, including a highly successful 5G spectrum auction\", Mobile World Congress said. IT Minister Ashwini Vaishnaw said the award is a \"recognition of Prime Minister Narendra Modi's efforts in the telecom sector\"."}, {"category": "technology", "title": "Gujarat receives ₹40,000-cr investment for green energy projects", "content": "The Gujarat government has signed an MoU with Abu Dhabi-headquartered Ocior Energy for the production of green hydrogen and green ammonia with an investment of ₹40,000 crore. As per the MoU, Ocior will set up a facility to produce one million tonnes of green hydrogen and ammonia per annum in Gujarat. The project will become operational by 2030."}, {"category": "technology", "title": "Spanish man jailed for slapping wife during TikTok livestream", "content": "A Spanish court has sentenced a man who slapped his wife during a TikTok livestream guilty to one year in prison. The court also banned the man from coming within 300 metres of his wife or communicating with her for three years. The man allegedly hit his wife's face so hard during the livestream in January that she started crying. "}, {"category": "technology", "title": "MoS IT launches Grievance Appellate Committee for users' appeals", "content": "Minister of State for Electronics and IT Rajeev Chandrasekhar launched the Grievance Appellate Committee for users to appeal against the decision of grievance officers of social media platforms. Last month, the IT Ministry asked for three Grievance Appellate Committees (GACs) as required under the amended IT rules. \"The move is to make sure that the internet remains...safe,\" Chandrasekhar said."}, {"category": "technology", "title": "Rajasthan to set up ₹147 cr IT development centre for e-governance", "content": "Rajasthan will set up the Rajiv Gandhi Centre for IT Development and e-Governance to tackle cyber crime, for which CM Ashok Gehlot approved ₹147.55 crore. According to a statement, the centre will \"develop a digital ecosystem for blockchain, cyber security, IFMS and data security\". It will create awareness about online fraud and will develop skills for use of blockchain technology."}, {"category": "technology", "title": "Govt aiming to pass Telecom Bill in Monsoon Session: Vaishnaw", "content": "The next major target for the government is to get the Telecom Bill passed during the upcoming Monsoon Session, Union Minister Ashwini Vaishnaw said on Tuesday. The bill will introduce significant reforms in terms of spectrum, licences and regulation, he added. According to the draft bill, internet-based over-the-top (OTT) services like WhatsApp will be brought under telecommunication services."}, {"category": "technology", "title": "Musk may appoint Boring Company CEO Davis as Twitter head: Report", "content": "Elon Musk may appoint his tunnel construction firm The Boring Company's CEO Steve Davis as Twitter's next CEO, Platformer reported. Musk had tasked Davis to cut Twitter's costs by $500 million. David ended up cutting nearly $1 billion and his success in \"bringing costs down by any means necessary\" has caused internal speculations that Musk will choose him, Platformer said."}, {"category": "technology", "title": "Foxlink's Andhra plant may not fully operate for 2 months: Report", "content": "Apple supplier Foxlink's plant in Andhra Pradesh, where a massive fire broke out on Monday, is reportedly unlikely to resume full operations for two months. As per Reuters, four out of the 10 assembly lines at the plant were completely damaged. The remaining six assembly lines were unaffected by the fire incident and will resume operations later this week."}, {"category": "technology", "title": "Govt completes Vi's ₹16,133 cr debt-to-equity conversion: Report", "content": "The Finance Ministry has completed the debt-to-equity conversion in Vodafone Idea (Vi) of its ₹16,133 crore interest dues and the government now holds a 33.4% stake, sources told Moneycontrol. \"The government does not intend to stay in it for long, and will look for an exit route once the share price is above ₹10,\" the sources added.\n"}, {"category": "technology", "title": "Meta-founded tool to help minors remove explicit images online", "content": "Facebook parent company Meta-founded free online tool 'Take it Down' was launched by the National Center for Missing and Exploited Children (NCMEC) in US to help minors remove their sexually explicit images from the internet. The tool will work on unencrypted and public online platforms. Online platforms such as Facebook, Instagram, OnlyFans and Pornhub will integrate this tool. "}, {"category": "technology", "title": "Tesla pauses rollout of self-driving software amid recall in US", "content": "Tesla paused rollout of the Full Self-Driving (FSD) Beta software until it addresses issues causing the carmaker to recall nearly 3,63,000 vehicles in US and Canada. The pause will impact customers who opted for the Beta feature but are yet to receive the update. The US National Highway Traffic Safety Administration said the feature can increase crash risk. "}, {"category": "technology", "title": "Microsoft adds new Bing to Windows computers in AI push", "content": "Microsoft on Tuesday started adding its recently upgraded Bing search engine to its Windows computer software in an effort to roll out artificial intelligence to hundreds of millions of people. In addition to the new Bing, Microsoft's Windows update will include software that can connect to iPhone messages and calls starting with a limited set of users, the company said.\n\n\n"}, {"category": "technology", "title": "Apple supplier Foxlink declares 30-day holiday at fire-hit factory", "content": "Apple supplier Foxlink has declared a 30-day holiday for its employees, following a massive fire at its assembly facility in Andhra Pradesh on Monday. The Taiwan-based company has declared holiday for a month to around 1,600 workers of the Jinkalamitta plant in Tirupati district, and directed them to return to their respective hometowns, a company official said."}, {"category": "technology", "title": "ISRO successfully conducts key engine test for Chandrayaan-3", "content": "ISRO on Monday announced the successful completion of the flight acceptance hot test of the CE-20 cryogenic engine that will power the cryogenic upper stage of the launch vehicle for the Chandrayaan-3 mission. The test was carried out for 25 seconds. \"All the propulsion parameters during the test were found satisfactory and closely matched with predictions,\" ISRO said."}, {"category": "technology", "title": "Apple largest job creator in electronics after PLI launch: Report", "content": "Apple's vendors and suppliers in India generated 1 lakh direct jobs in the 19 months since the launch of government's Production Linked Incentive (PLI) scheme, Business Standard reported. This made Apple the single largest job creator in the electronics sector. Out of the total jobs, reportedly 60% were from three iPhone assemblers, Foxconn Hon Hai, Pegatron and Wistron."}, {"category": "technology", "title": "Musk, Tesla face shareholders' lawsuit in US over self-driving EVs", "content": "Tesla shareholders filed a lawsuit in the US against the company and its CEO Elon Musk, accusing them of misleading them over the effectiveness of the self-driving technology in their electric vehicles (EVs). Tesla had recalled 3.62 lakh vehicles in February after a US regulator raised questions over the technology. The lawsuit has sought unspecified monetary compensation for the shareholders."}, {"category": "technology", "title": "ONDC offers discounts to raise daily transactions to 5,000: Report", "content": "The government-backed Open Network for Digital Commerce (ONDC) has reportedly started offering discount coupons to users to increase the daily number of transactions on the platform to 5,000 from the current 200. The scheme will run through March, Moneycontrol reported. ONDC will reportedly also establish monitoring systems to prevent the misuse of incentives."}, {"category": "technology", "title": "5G to make our cities smarter, society safer: Akash Ambani", "content": "Reliance Jio Chairman Akash Ambani said the impact that 5G will have on India's growing economy is immense. \"5G will make our cities smarter and society safer, utilities more stable and emergency services more responsive and industry more efficient,\" he added. \"5G technologies have had a profound impact on modern societies...5G is...among the top contenders of this technology,\" he said.\n"}, {"category": "technology", "title": "No machine can compete with power of human mind: Narayana Murthy", "content": "Infosys Founder NR Narayana Murthy said humans have the power of the mind, which no machine can compete with. Human mind is one step ahead of technology and it is capable of becoming its \"master\", Murthy said. \"Many thought at one point of time that all these computers will make us more free. It hasn't happened,\" he added."}, {"category": "technology", "title": "White House gives govt agencies 30 days to implement TikTok ban", "content": "The White House on Monday gave government agencies 30 days to remove Chinese-owned app TikTok from government-issued devices and systems. This comes after the Congress passed a bill in December to ban the application amid national security fears that Beijing could use it to spy on Americans. Canada, the European Union, Taiwan have also banned the application."}, {"category": "entertainment", "title": "Missing head of 28-year-old model found in soup pot in Hong Kong", "content": "A skull and ribs believed to be of Hong Kong model Abby Choi were found in a soup pot of a house. Police had earlier stated they were \"looking for the head\" of the 28-year-old after her limbs were discovered inside a refrigerator. Her ex-husband Alex Kwong, his father Kwong Kau and brother Anthony Kwong were charged with murder."}, {"category": "entertainment", "title": "Thank you all the haters, those who blacklisted me: Hazel in her b'day post", "content": "Actress Hazel Keech, wife of former cricketer Yuvraj Singh, took to Instagram to share a message on her 36th birthday. \"This birthday...I'd like to thank all the haters, backbiters, manipulators, the people that shun me and bad mouth me,\" she wrote. She also thanked those who blacklisted her from work and trolled her, saying that it made her skin thicker."}, {"category": "entertainment", "title": "Brand rejected me as model, later signed me as ambassador: Sobhita", "content": "Sobhita Dhulipala revealed that she was once rejected as a background model for a brand that later signed her as a brand ambassador. \"I was with Aishwarya Rai Bachchan, passing shampoos, doing the ad, and I'm just like nice. It's nice to be here,\" she added. Sobhita was recently seen in Aditya Roy Kapur and Anil Kapoor-starrer 'The Night Manager'.   "}, {"category": "entertainment", "title": "I distance myself from Hindu, pseudo-liberal propaganda: Rajamouli", "content": "Filmmaker SS Rajamouli has said that no one has approached him to make an \"agenda film\". \"I distance myself from either Hindu or pseudo-liberal propaganda. I know there are audience members from those extreme groups in my audience. I know that but I'm not catering to them,\" he stated. He added he's catering to the \"emotional needs\" of the audience."}, {"category": "entertainment", "title": "It's been pretty psychotic: Shahid Kapoor on his journey as actor", "content": "Shahid Kapoor spoke about his journey as an actor, calling it \"pretty psychotic\". \"When I look back at my own career, I am like 'what was I thinking with some of the choices?'\" Shahid said, adding, \"'Kaminey' followed up by 'Dil Bole Hadippa!', 'Haider' followed up by 'R Rajkumar'. I don't know what was going on with me.\"   "}, {"category": "entertainment", "title": "Used to hate it when people used to say 'Oh, you are cute': Shahid", "content": "Shahid Kapoor spoke about being called 'cute' by his fans and said, \"I used to hate it when people used to say 'Oh, you are cute'.\" \"Like why would you say that? I never liked that word,\" he added. \"I've learnt to be graceful and accept when people throw it at you...I just felt it was very limiting,\" said Shahid.    "}, {"category": "entertainment", "title": "Was told I can either be composer, lyricist or singer: Kuhad", "content": "Singer Prateek Kuhad revealed a Bollywood director, who he didn't name, once told him he can either be a composer, lyricist or singer but not all three. \"I was like I want to do all three because I can,\" he stated. Speaking about the unnamed director, Kuhad said, \"He has made a lot of fairly big mid-budget films that did...well.\" "}, {"category": "entertainment", "title": "This is my age to make mistakes: Sara on her B'wood journey", "content": "Actress Sara Ali Khan, speaking about her journey in Bollywood, has said that she always tries to learn something. \"But I also feel that I have made some mistakes. I have done such films which have not been loved by the audience. But then again, this is my age to make mistakes,\" she stated. Sara made her debut with 'Kedarnath'."}, {"category": "entertainment", "title": "Farhan Akhtar cancels Australia tour, pens note for fans", "content": "Farhan Akhtar took to Instagram to share that his band, FarhanLive, won't be able to perform in Australia due to \"unforeseen circumstances\". He wrote, \"Please believe me when I say...we share your disappointment. However, I do hope to come to your beautiful country...and perform for you.\" His band was set to perform in Sydney and Melbourne over the weekend.    "}, {"category": "entertainment", "title": "Naseeruddin thanked God for less romantic scenes with me: Sandhya", "content": "Actress Sandhya Mridul, while speaking about her 'Taj: Divided by Blood' scenes, said that actor Naseeruddin Shah thanked God for not having many romantic scenes with her. \"He always used to say, 'Oh My God! This girl looks too young...Sandhya Mridul do you ever age?'...even if there was a little discomfort during the scene...he used to just joke,\" Mridul added. "}, {"category": "entertainment", "title": "Courteney gets star on H'wood Walk of Fame, Aniston pens note", "content": "Actress Courteney Cox was honoured with a star on the Hollywood Walk of Fame. Along with Courteney, the ceremony was also attended by her 'Friends' co-stars Jennifer Aniston and Lisa Kudrow. Sharing some pictures from the ceremony, Aniston wrote on Instagram, \"Very proud of our girl Courteney Cox...Lisa and I were on a cloud being able to celebrate...her incredible achievements.\"   "}, {"category": "entertainment", "title": "Need to cast big actor to attract numbers: Abhinay Deo on OTT", "content": "Filmmaker Abhinay Deo, speaking about OTT content, has said, \"It's good because the format allows us to do so much more. But at the same time, [OTT content] has started getting into a rut.\" He added that they are being dominated by the need for numbers. \"So, we need to [cast] big actors in the projects,\" he added."}, {"category": "entertainment", "title": "Was nervous dancing with Sridevi & Urmila: Anil on 'Judaai'", "content": "Marking 26 years since the release of his film 'Judaai', Anil Kapoor on Tuesday shared throwback pictures with his co-stars Sridevi and Urmila Matondkar from the sets. \"Decision to do Judaai wasn't easy...for me...but I'm...glad that I chose to do it,\" Anil wrote, adding, \"I still remember how nervous I was dancing with Sri ji & Urmila as they...are...incredible dancers.\""}, {"category": "entertainment", "title": " My dream was to be a Mani Ratnam heroine: Aditi Rao Hydari", "content": "Actress Aditi Rao Hydari said that her dream was to be a Mani Ratnam heroine. \"I knew that I have to speak Tamil because that is his language, you know, and he would be happiest making a Tamil film,\" she further added. Aditi will next be seen in the series 'Taj: Divided by Blood' where the actress will play Anarkali."}, {"category": "entertainment", "title": "Shivaleeka shares pics with Abhishek Pathak from wedding reception", "content": "Actress Shivaleeka Oberoi and filmmaker Abhishek Pathak recently hosted a wedding reception in Mumbai, which was attended by several celebrities. In the pictures shared by Shivaleeka on her Instagram handle, the couple can be seen posing with Kartik Aaryan, Nushrratt Bharuccha, Sunny Singh and Ishita Raj. Shivaleeka and Abhishek got married on February 9.    "}, {"category": "entertainment", "title": "A common man: Kartik Aaryan as fan asks who's his inspiration", "content": "Kartik Aaryan, during an #AskKartik session on Twitter, was asked by a fan to talk about his inspiration. He replied, \"A common man who works day and night tirelessly to bring smile on their loved [one's] face.\" Kartik recently won his first Best Actor award for 'Bhool Bhulaiyaa 2'. Talking about it, Kartik wrote, \"It happened after a long wait.\""}, {"category": "entertainment", "title": "I thought I'd have to audition: Masaba on 'Marvel's Wastelanders'", "content": "Speaking about being part of the Hindi audio series 'Marvel's Wastelanders', Masaba Gupta said she thought she would have to audition for the part. \"It's great...India is on everyone's mind right now. Look at...'RRR' doing so well. Content from across the world is being consumed by people,\" she added. Kareena Kapoor Khan will also be part of the Audible series."}, {"category": "entertainment", "title": "Thrilled to have our baby delivered in India: Ram Charan's wife", "content": "Actor Ram Charan's wife Upasana Kamineni Konidela said in a statement that they are thrilled to have their first child delivered in India. \"This journey holds many exciting experiences for us and we look forward to this new phase in our lives with great anticipation,\" the statement added. Ram and Upasana announced their pregnancy in December last year."}, {"category": "entertainment", "title": "Ram Charan's RC15 to clash with Kamal Haasan's Indian 2: Report", "content": "The release date of actor Ram Charan's upcoming film will reportedly clash with Kamal Haasan's 'Indian 2'. According to reports, both films will release on Makar Sankranti next year. Ram's upcoming film is tentatively titled 'RC 15'. Kamal's 'Indian 2' is directed by Shankar and the film is a sequel to his 1996 film 'Indian'. "}, {"category": "entertainment", "title": "Reactions to trailer are too special: Rani on 'Mrs Chatterjee...'", "content": "Actress Rani Mukerji said that the reactions to the trailer of her upcoming film 'Mrs Chatterjee Vs Norway' are \"too special and overwhelming\" for her. \"In my entire career, this is probably the first time I am witnessing so much love and emotion of this kind for my work,\" she added. The film is set to release on March 17.   "}, {"category": "entertainment", "title": "Said sorry to mom after doing underwear ad: Michael B Jordan   ", "content": "Actor-filmmaker Michael B Jordan revealed that he apologised to his mother before the pictures from his underwear ad hit the internet. \"I was like, my mama going to have to see this. Let me call her and be like, 'I'm sorry. It's out here.' My business all out in the streets - literally,\" Michael, who starred in 'Black Panther', said.    "}, {"category": "entertainment", "title": "Saiyami to play para-athlete in R Balki's 'Ghoomer'", "content": "Actress Saiyami Kher will play the role of a para-athlete in R Balki's 'Ghoomer'. \"I could never...step into the shoes of a real-life para-athlete, but even small hurdles I had to overcome being an athlete myself, reminded me of things we take for granted,\" she stated. Speaking about filming 'Ghoomer', Saiyami said it was a \"physically and emotionally challenging time\"."}, {"category": "entertainment", "title": "'Jab We Met' happens once in two decades: Shahid Kapoor", "content": "Actor Shahid Kapoor opened up about his 2007 film 'Jab We Met' and said that a film like this happens once in two decades. \"Most of the films one does in this genre are bad, so one needs to pick up a decent script...Imtiaz Ali and I were also chatting to find something in this space again,\" he added."}, {"category": "entertainment", "title": "Buying PR isn't success: Sona Mohapatra after tweet on Shehnaaz", "content": "Singer Sona Mohapatra tweeted that \"sucking up to successful men\" and \"buying PR\" isn't success. \"Spend some money, time...on getting...education...Practice...craft you want to project as your talent, profession,\" she added. Sona's new tweet has come days after a tweet in which she wrote that she doesn't know what's Shehnaaz Gill's talent \"apart from [being a] low-brow reality TV fame\"."}, {"category": "entertainment", "title": "Sometimes, I did films just to pay the rent: Sharmila Tagore  ", "content": "Veteran actress Sharmila Tagore in an interview opened up about how she picked the projects back in the 70s and 80s. She revealed that she sometimes did films \"for money, just to pay the rent\". \"Sometimes we help a colleague or somebody who thinks if I'm in the project, the project will do well,\" she added.  "}, {"category": "world", "title": "What is the new drug-resistant Shigella bacteria spreading in US?", "content": "US' Centers for Disease Control and Prevention (CDC) has reported a rise in the number of contagious stomach infections caused by a new extensively drug-resistant (XDR) Shigella. As per CDC's February 24 advisory, the bacteria causes inflammatory diarrhoea, and may also lead to fever, abdominal cramping, and tenesmus. It's transmitted via the faecal-oral route and sexual contact."}, {"category": "world", "title": "Drone targeting civilian facilities crashes near Moscow: Report", "content": "A drone that was most likely aiming at civilian infrastructure crashed 110 km away from Moscow, regional governor Andrei Vorobyov said. This comes as several drone attacks occurred over the last two days targeting regions in Russia along the Ukraine border. Notably, some Russian television channels and radio stations had also reported their servers being hacked."}, {"category": "world", "title": "Chinese Foreign Minister Qin Gang to attend G20 meet in India", "content": "China has confirmed that its Foreign Minister Qin Gang will travel to India to take part in the G20 Foreign Ministers' meeting on March 2 in Delhi. Spokesperson Mao Ning said, \"China stands ready to work with all parties to ensure the...meeting sends a positive signal on multilateralism.\" This comes after Ladakh military standoff between the two countries in 2020."}, {"category": "world", "title": "J'khand labourers stranded in Tajikistan to return home: Official", "content": "Migrant labourers from Jharkhand, stranded in Tajikistan for over two months, will return to their home state, an official said on Tuesday. In the first phase, 22 of the 35 stranded labourers will return home. Earlier, labourers claimed a company engaging them in laying of power transmission lines seized their passports and provided them with scant food and no money."}, {"category": "world", "title": "Probe attacks on fishermen: India to S Lanka after pirate attack", "content": "The Indian High Commission in Sri Lanka has urged the Sri Lankan government to conduct an investigation on the recent attacks on Indian fishermen, stating that they shouldn't be subjected to any form of force or violence. Earlier this month, several Sri Lankan pirates had attacked Indian fishermen by jumping on their boat and attacking them with knives."}, {"category": "world", "title": "Hungarian airline to suspend Moldova flights amid airspace concern", "content": "Hungarian low-cost carrier Wizz Air has said it will suspend flights to Moldova's capital Chisinau from March 14, citing concerns over safety of the latter's airspace. The airline added that it would re-route existing flights to Chisinau to other locations. The move comes amid allegations from Moldovan President Maia Sandu, who has accused Russia of trying to topple Moldovan government."}, {"category": "world", "title": "No definitive conclusion: White House on COVID-19 lab leak report", "content": "The White House on Monday said \"there's not been a definitive conclusion\" on the origins of COVID-19. This comes a day after Department of Energy said the coronavirus pandemic likely emerged from a Chinese laboratory leak. \"The intelligence community and the rest of the government are still looking at this,\" National Security Council Coordinator for Strategic Communications John Kirby said. "}, {"category": "world", "title": "Turkey might jail landlords who spike rent amid earthquake crisis", "content": "Turkey is considering prison terms for landlords found guilty of spiking rents after the recent deadly earthquakes that hit the country. The Turkish government is reportedly considering jail terms of two-to-five years for those found guilty, Bloomberg reported. The move also comes as the government has planned 4,00,000 new residential units across the quake zone within a year."}, {"category": "world", "title": "Migrants who died enroute to Italy in boat paid ₹7 lakh each", "content": "The migrants who died in the recent Italy shipwreck incident had paid 8,000 euros (over ₹7 lakh) each to board the vessel, Italian authorities said as rescue operations continued on Tuesday. At least 65 people died when their overcrowded wooden boat slammed into the shoals 100 meters off the shore of Cutro. Several passengers hailed from Pakistan, Syria and Afghanistan."}, {"category": "world", "title": "Turkey's economy grows 5.6% in 2022, growth may slow after quakes", "content": "Turkey's economy expanded by 5.6% in 2022, official data showed on Tuesday. However, growth was expected to slow significantly to 2.8% in 2023 after the earthquakes caused widespread destruction in the country's southern part. Growth stood at 3.5% in the fourth quarter of 2022, down from a revised 4% in the third quarter and 7.8% in the second quarter.\n"}, {"category": "world", "title": "England & Wales raise legal age to 18 to curb forced marriages", "content": "England and Wales have raised the legal age for marriage to 18 through a new law. The law is aimed at protecting people from being forced into marriage against their will. Earlier, those aged 16 or 17 could get married with parental consent as there was no law against ceremonies for younger persons not registered as vulnerable by local councils."}, {"category": "world", "title": "Russia steals our children, this is genocidal crime: Ukraine", "content": "Ukrainian Foreign Minister Dmytro Kuleba has called Russia's reported deportation of Ukrainian children the \"largest forced deportation in modern history\". \"The most chilling crime is that Russia steals Ukrainian children. This is a genocidal crime,\" Kuleba said. Russia has held at least 6,000 Ukrainian children, a US-backed report stated. Russia-Ukraine war began on February 24, 2022."}, {"category": "world", "title": "40,000 Syrians return to country from Turkey after earthquakes", "content": "Around 40,000 Syrians, who had escaped areas affected by recent earthquakes, have returned from Turkey to rebel-held northwestern Syria. The move comes as Turkey eased restrictions on their movements placed last year, which banned Syrians with temporary protection permits from making round-trips to Syria in an effort to promote one-way returns. Turkey is home to 3.5 million Syrian refugees."}, {"category": "world", "title": "UK woman died after breathing tube put in food pipe, finds probe", "content": "A 32-year-old woman in UK's Hatfield died after a trainee doctor put a breathing tube in the former's food pipe instead of her wind pipe during surgery in 2020, an inquest heard. The deceased, identified as Emma Currell, suffered a cardiac arrest following the incident. Currell had earlier been rushed to the hospital as she suffered seizure after dialysis treatment."}, {"category": "world", "title": "UN suspends eastern Congo aid flights after helicopter fired on", "content": "The UN said it's suspending humanitarian flights across much of conflict-torn eastern DR Congo after one of its helicopters came under attack. The helicopter returning from Walikale to Goma in North Kivu province came under attack for 10 minutes on February 24, UN's World Food Program (WFP) said. However, the plane was able to land safely in Goma, WFP added. "}, {"category": "world", "title": "Andrew Tate to remain in jail as Romanian court upholds extension", "content": "Former professional kickboxer and controversial social media influencer Andrew Tate will remain in prison as a Romanian court has upheld a third 30-day detention for him on suspicion of organised crime and human trafficking. Tate lost his appeal on Monday against a judge's decision to extend his arrest a third time. Tate has 5.2 million followers on Twitter."}, {"category": "world", "title": "Russia closes airspace over St Petersburg for air defence drills", "content": "Russia's Defence Ministry has clarified that it briefly closed the airspace over St Petersburg to practice air defence drills involving interceptor jets. The Pulkovo Airport had to suspend all flights on Tuesday for an hour. Earlier, reports surfaced that the airport was shut after an unidentified object, such as a drone, had been spotted in the area."}, {"category": "world", "title": "Bhutan to sell gold at duty-free shops to boost tourism: Report", "content": "Bhutan is reportedly set to sell gold at duty-free shops from March 1 onwards in a bid to boost tourism. The gold will be available for purchase for tourists who visit the country after paying the 'Sustainable Development Fee' and spend at least one night at a Department of Tourism-certified hotel in Phuentsholing or Thimphu."}, {"category": "world", "title": "Italian mafia boss escapes from jail using bedsheets; video out", "content": "A mafia boss escaped a high-security jail in Italy by using knotted-up bed sheets. A video of Marco Raduano's climbing escape has gone viral on social media. Marco Raduano, who was serving an 18-year sentence for drug trafficking, escaped from the Badu'e Carros prison in Sardinia on Friday. The escape reportedly went unnoticed for two hours due to \"staff shortages\". "}, {"category": "world", "title": "Stop migrant boats: Italy to EU as shipwreck death toll reaches 64", "content": "The death toll from a migrant shipwreck near the southern Italian coast has risen to 64. The vessel, which was carrying around 200 people, sank on Sunday. Italian Prime Minister Giorgia Meloni said that she has written to European Union institutions calling for immediate action by the bloc to stop migrant boat trips to prevent more deaths."}, {"category": "world", "title": "Russia is destroying everything: Zelenskyy on situation in Bakhmut", "content": "Ukrainian President Volodymyr Zelenskyy said the condition in Bakhmut, where the country's forces are fighting the Russians, is becoming \"more and more difficult\". \"The enemy is...destroying everything that can be used to protect our positions,\" Zelenskyy added. Russia, which has been trying to seize the city for over six months, is attempting to cut the supply lines to the city."}, {"category": "world", "title": "White House gives govt agencies 30 days to implement TikTok ban", "content": "The White House on Monday gave government agencies 30 days to remove Chinese-owned app TikTok from government-issued devices and systems. This comes after the Congress passed a bill in December to ban the application amid national security fears that Beijing could use it to spy on Americans. Canada, the European Union, Taiwan have also banned the application."}, {"category": "world", "title": "UK strikes post-Brexit Northern Ireland trade deal with EU", "content": "British PM Rishi Sunak has struck a deal with the European Union on post-Brexit trade rules for Northern Ireland. The deal aims to relax physical checks on goods going from Britain to Northern Ireland. \"I'm pleased to report that we have now made a decisive breakthrough,\" Sunak said, adding it'd start a new chapter in London's relationship with the EU."}, {"category": "world", "title": "Shots fired near school in Germany, 2 including shooter injured", "content": "A gunman wounded one person near a German primary school on Tuesday before critically injuring himself with the weapon, police said. The shooter and the victim have been airlifted to a hospital and are receiving medical treatment. Police said they are interviewing witnesses regarding the incident and there is no longer any danger to the public."}, {"category": "world", "title": "India precisely the partner US needs to check China: Schumer", "content": "US Senator Chuck Schumer said \"India is precisely the kind of partner\" the US needs to provide a check against China. \"India and America are going to need each other to outcompete the Chinese Communist Party,\" Schumer stated. Schumer, who recently returned from India, said he told PM Narendra Modi the two nations should work together in order to prosper."}, {"category": "business", "title": "Sachin Tendulkar and his wife meet Bill Gates; share pics", "content": "Former cricketer Sachin Tendulkar and his wife Anjali Tendulkar met with Microsoft Co-founder Bill Gates in Mumbai on Tuesday. Sharing pictures of the meeting on social media, Sachin Tendulkar wrote, \"We are all students for life. Today was a wonderful learning opportunity to gain perspectives on philanthropy - including children's healthcare, which our Foundation works on.\" "}, {"category": "business", "title": "'Best wishes to my classmate,' writes Gates in book gifted to Mahindra, latter shares pic", "content": "Businessman Anand Mahindra on Tuesday met Microsoft Co-founder Bill Gates, who is currently on a visit to India. Mahindra said that Gates gifted an autographed copy of his book to him with a message saying, \"Best wishes to my classmate!\" Mahindra had earlier said that Gates started Harvard College the same year as him in 1973 but later dropped out."}, {"category": "business", "title": "Ambanis should get Z+ security cover across India, abroad; cost to be borne by them: SC", "content": "The Supreme Court on Tuesday stated that the Z+ security cover provided to billionaire businessman Mukesh Ambani and his family shouldn't be restricted to Mumbai. It directed Ministry of Home Affairs to ensure that Z+ security cover is made available to them across India and abroad. Entire cost of security shall be borne by the Ambanis, the court added."}, {"category": "business", "title": "People consuming 30 GB and paying almost nothing: Airtel's Mittal", "content": "Bharti Airtel is looking to raise mobile phone call and data rates across all plans this year. \"Salaries have gone up, rents have gone up except one thing. There's no one complaining. People are consuming 30 GB for almost paying nothing,\" Bharti Airtel's Chairman Sunil Mittal said. Airtel stopped its ₹99 minimum recharge plan which offered 200 MB of data."}, {"category": "business", "title": "India's GDP growth slows down to 4.4% in Oct-Dec quarter", "content": "India's GDP growth rate fell for the second consecutive quarter in October-December, coming in at 4.4%, Ministry of Statistics and Programme Implementation data showed. The latest quarterly growth number is lower than the 6.3% growth that was witnessed in the second quarter of 2022-23. In December, RBI had forecast a growth rate of 4.4% for the last quarter of 2022.\n"}, {"category": "business", "title": "Apple supplier Foxlink's fire safety systems faulty: Fire official", "content": "Most of the fire safety equipment at Apple supplier Foxlink's assembly facility in Andhra Pradesh was not functional, J Ramanaiah, who leads the regional Fire Services Department, said a day after a massive blaze forced production to be halted. Except for fire extinguishers, Ramanaiah said, smoke detectors, sprinklers and fire hydrants were in faulty condition. "}, {"category": "business", "title": "Govt aiming to pass Telecom Bill in Monsoon Session: Vaishnaw", "content": "The next major target for the government is to get the Telecom Bill passed during the upcoming Monsoon Session, Union Minister Ashwini Vaishnaw said on Tuesday. The bill will introduce significant reforms in terms of spectrum, licences and regulation, he added. According to the draft bill, internet-based over-the-top (OTT) services like WhatsApp will be brought under telecommunication services."}, {"category": "business", "title": "Gujarat receives ₹40,000-cr investment for green energy projects", "content": "The Gujarat government has signed an MoU with Abu Dhabi-headquartered Ocior Energy for the production of green hydrogen and green ammonia with an investment of ₹40,000 crore. As per the MoU, Ocior will set up a facility to produce one million tonnes of green hydrogen and ammonia per annum in Gujarat. The project will become operational by 2030."}, {"category": "business", "title": "Apple supplier Foxlink declares 30-day holiday at fire-hit factory", "content": "Apple supplier Foxlink has declared a 30-day holiday for its employees, following a massive fire at its assembly facility in Andhra Pradesh on Monday. The Taiwan-based company has declared holiday for a month to around 1,600 workers of the Jinkalamitta plant in Tirupati district, and directed them to return to their respective hometowns, a company official said."}, {"category": "business", "title": "SoftBank to sell ₹600 cr Delhivery stake via block deals: Report", "content": "SoftBank is reportedly planning to sell shares of Gurugram-based logistics and supply chain company Delhivery, worth ₹600 crore, via block deals on March 1. SoftBank may increase the size if there is strong demand. The shares will be sold at a 3-5% discounted rate to current market price. Prior to Delhivery's IPO, SoftBank acquired over 22% stake in the company."}, {"category": "business", "title": "India's automobile making sector to hit ₹15 lakh cr soon: Gadkari", "content": "The automobile manufacturing sector in India is expected to grow from ₹7.8 lakh crore to ₹15 lakh crore in the near future, Union Minister Nitin Gadkari said. The sector will employ 5 crore people by 2025, he added. Virtually inaugurating Tata Motor's vehicle scrapping facility, Gadkari mentioned that government's scrapping policy will generate an additional GST revenue of ₹40,000 crore."}, {"category": "business", "title": "Razorpay's revenue rises 76% in FY22 in 2nd straight profitable yr", "content": "Fintech unicorn Razorpay's total revenue jumped 76% to ₹1,485.7 crore from ₹844.6 crore in the fiscal year 2022.  The company, which had turned profitable in FY21 on a standalone basis, recorded a profit of ₹7.3 crore, up by 18% in FY22. Razorpay﻿ earns revenue from fees paid by merchants, followed by software development and maintenance services and marketing services."}, {"category": "business", "title": "Retail inflation for industrial workers hits 6.16% in January", "content": "Retail inflation for industrial workers rose to 6.16% in January 2023, mainly due to lower prices of certain food items, according to the data released by Labour Ministry. Retail inflation for industrial workers stood at 5.50% during December 2022. The food inflation stood at 5.69% in January as against 4.10% in December last year, data showed."}, {"category": "business", "title": "Turkey's economy grows 5.6% in 2022, growth may slow after quakes", "content": "Turkey's economy expanded by 5.6% in 2022, official data showed on Tuesday. However, growth was expected to slow significantly to 2.8% in 2023 after the earthquakes caused widespread destruction in the country's southern part. Growth stood at 3.5% in the fourth quarter of 2022, down from a revised 4% in the third quarter and 7.8% in the second quarter.\n"}, {"category": "business", "title": "GDP to likely grow 7% in FY23: Second advance estimates", "content": "India's gross domestic product (GDP) may grow 7% for financial year 2022-23, according to the second advance estimates released on Tuesday. The same figure was predicted in the first advance estimates released in early January. The government released the revised estimate of economic growth for financial year 2021-22 at 9.1%. It was estimated at 8.7% in May 2022. "}, {"category": "business", "title": "India's manufacturing sector is in 'good health': CEA Nageswaran", "content": "Chief Economic Adviser (CEA) V Anantha Nageswaran on Tuesday said that India's manufacturing sector is in \"good health\". \"Manufacturing...appears to have slowed down in real terms because of the rising input costs...But if you look at the Purchasing Managers' Index indicators, the manufacturing sector is in good health,\" he added. Manufacturing sector's GVA contracted by 1.1%  in third quarter."}, {"category": "business", "title": "India's core sector growth rises to 4-month high at 7.8% in Jan", "content": "Production of eight infrastructure sectors expanded at a four-month high of 7.8% in January 2023, Ministry of Commerce and Industry data showed. The output of core sectors had increased by 4% in January 2022. The production of all the sectors except crude oil increased in the month. Crude oil output contracted by 1.1%, marking the eighth consecutive monthly decline."}, {"category": "business", "title": "In a first, women make up 40% of boards at top UK companies", "content": "For the first time in 2022, women's share of board seats at Britain's 350 biggest listed companies reached 40%, a UK government-backed report on Tuesday showed. In February 2022, the FTSE Women Leaders Review set FTSE 350 companies a 40% target for women on boards and in leadership teams by 2025, up from a previous target of 33%."}, {"category": "business", "title": "SEBI cancels registration of 4 brokers in NSEL case", "content": "SEBI has cancelled the registration of four stock brokers for facilitating its clients to trade on the platform of now-defunct National Spot Exchange Ltd (NSEL) in illegal 'paired contracts'. The brokers exposed the clients to the risk involved in trading in a product that didn't have regulatory approval, it said. These brokers include Share India Commodity Brokers and Sharewealth Commodities."}, {"category": "business", "title": "Oil tankers, bulk carriers over 25 yrs old banned to cut emissions", "content": "India has withdrawn trading licences for oil tankers and bulk carriers older than 25 years to cut emissions, the Directorate General of Shipping said. The order also bans the acquisition of vessels that are more than two decades old. Under the current guidelines, vessels that are less than 25 years old can be acquired without any technical clearance."}, {"category": "business", "title": "India kept its interest at the top in importing cheaper fuel: FM", "content": "Finance Minister Nirmala Sitharaman said that India chose to import cheaper fuel from Russia and other available sources keeping the country's interest in mind. \"We did not come under any pressure, we made sure that affordable fuel came to India. So, we took decisions which put India's interest on the top,\" Sitharaman said."}, {"category": "business", "title": "HDFC, Punjab National Bank hike lending rates by up to 25 bps", "content": "Housing finance major HDFC and state-run Punjab National Bank (PNB) on Tuesday announced an increase in their lending interest rates by up to 25 basis points. HDFC has increased its retail prime lending rate by 25 bps to a minimum of 9.20%. PNB increased its Marginal Cost of Funds Based Lending Rate (MCLR) by 10 bps to 8.5% from 8.4%."}, {"category": "business", "title": "RIL sets up subsidiary to develop commercial properties", "content": "Reliance Industries Limited (RIL) has set up a wholly-owned subsidiary—Reliance SOU—to develop properties for commercial use. RIL has invested ₹1,00,000 in the equity shares of Reliance SOU Limited, it said in a stock exchange filing. RIL's fully-owned subsidiary Model Economic Township Limited is currently engaged in the development of an integrated industrial township in Jhajjar in Haryana."}, {"category": "business", "title": "Moody's slashes Pak's rating to 'Caa3', changes outlook to stable", "content": "Moody's Investors Service said it has downgraded Pakistan's local and foreign currency issuer and senior unsecured debt ratings to \"Caa3\" from \"Caa1\". The decision is driven by Moody's assessment that Pakistan's \"increasingly fragile liquidity\" significantly \"raises default risks\" to a level consistent with a Caa3 rating. Moody's also changed the country's outlook to \"stable from negative\"."}, {"category": "business", "title": "Adani falls from 3rd to 33rd spot on the rich list within a month", "content": "Billionaire Gautam Adani's position on the Forbes rich list has dropped to the 33rd spot from third position within a month. According to Forbes' real-time tracker, Adani's net worth is currently estimated at $35.1 billion. His net worth, as per Forbes, was $119 billion before the Hindenburg report was published on January 24."}]